{
    "version": "https://jsonfeed.org/version/1",
    "title": "Seb Jensen - C2B",
    "description": "",
    "home_page_url": "https://sebjensen.github.io/c2blog",
    "feed_url": "https://sebjensen.github.io/c2blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Seb Jensen"
    },
    "items": [
        {
            "id": "https://sebjensen.github.io/c2blog/animations-interactive-features.html",
            "url": "https://sebjensen.github.io/c2blog/animations-interactive-features.html",
            "title": "Animations / Interactive features",
            "summary": "The use of animations and interactive features will go a long way to enhance the user experience. They engage the user and keep them interested in the content that will be delivered to them by my interactive kiosk product. I identified a number of interactive&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">The use of animations and interactive features will go a long way to enhance the user experience. They engage the user and keep them interested in the content that will be delivered to them by my interactive kiosk product. I identified a number of interactive features that I wish to recreate in my initial research document as part of the pre-production process for my project.</span></p>\n<p><span style=\"font-weight: 400;\">I don’t think I want to include too many animations, but I will be able to use the functionality within PowerPoint to create a gallery as well as attract users to a start button on the splash screen.</span></p>\n<h2>Animations</h2>\n<p><span style=\"font-weight: 400;\">I have used the animations pane functionality included in PowerPoint to create a looping growing animation on the start button. I have used the same asset that I created a couple of sessions ago. This will attract users to the start button, having them press it to begin the experience with the trailer for RLCS that I also downloaded when collecting assets from the source.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/9/Animated-start-button.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/9/responsive/Animated-start-button-xs.PNG 300w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Animated-start-button-sm.PNG 480w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Animated-start-button-md.PNG 768w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Animated-start-button-lg.PNG 1024w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Animated-start-button-xl.PNG 1360w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Animated-start-button-2xl.PNG 1600w\"  alt=\"\" width=\"803\" height=\"765\"></figure>\n<h2>Interactive features</h2>\n<h3>Videos</h3>\n<p><span style=\"font-weight: 400;\">I wish to include the trailer for RLCS that I downloaded while collecting various assets from the source. To remove the unnecessary details at the end of the trailer and therefore make it more appropriate for my new audience, I have used the trim functionality included in PowerPoint to remove the end portion of the video. The slide should automatically advance at the same time the video ends. The inclusion of a video will benefit users who have limited knowledge of the Rocket League Championship Series and Rocket League Esports in general. It will also capture their attention and generate interest in the product, encouraging them to check out the various pages to learn more.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/9/Video-trim.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/9/responsive/Video-trim-xs.PNG 300w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Video-trim-sm.PNG 480w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Video-trim-md.PNG 768w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Video-trim-lg.PNG 1024w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Video-trim-xl.PNG 1360w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Video-trim-2xl.PNG 1600w\"  alt=\"\" width=\"1493\" height=\"848\"></figure>\n<h3>Buttons</h3>\n<p><span style=\"font-weight: 400;\">I considered the inclusion of various buttons with the creation of my own assets. I have always intended to incorporate a splash screen with a start button, and have animated it as detailed above. Buttons form the basis of kiosk navigation, as the device should be accessible with touch and by using a mouse.</span></p>\n<p><span style=\"font-weight: 400;\">I intend to include buttons on most pages. These will be hyperlinked to other slides in the interactive kiosk, or link to external sources that are not affected by the offline operation of the kiosk. By including information from official websites, I can still offer up-to-date information and resources, such as the live Twitch stream as PowerPoint does not natively support the embedding of them.</span></p>\n<p><span style=\"font-weight: 400;\">The design of buttons, which I have already considered, have a large impact on establishing hierarchy and orientating the user. Some may be larger and more prominent to suggest significance, while others are much smaller and offer less relevant information or lead to slides that are predicted to receive less traffic.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/9/Buttons.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/9/responsive/Buttons-xs.PNG 300w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Buttons-sm.PNG 480w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Buttons-md.PNG 768w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Buttons-lg.PNG 1024w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Buttons-xl.PNG 1360w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Buttons-2xl.PNG 1600w\"  alt=\"\" width=\"1150\" height=\"784\"></figure>\n<h3>Gallery</h3>\n<p><span style=\"font-weight: 400;\">For those who are entirely new to the game, let alone any sorts of Rocket League Esports such as RLCS, I am including a gallery of in-game screenshots to help convey the gist of the game visually. As opposed to offering an entire additional slide full of written content about how the game works, by presenting these users with images instead, they are able to form the concept of the game much more easily and naturally.</span></p>\n<p><span style=\"font-weight: 400;\">I am using PowerPoint’s trigger animation functionality to show and hide larger versions of a screenshot when their respective thumbnails are clicked. Then, when you click the thumbnail again, the large screenshot will hide. This means that the user can select which screenshot they wish to view a larger version of. I have used many of the original assets that I collected at the beginning of the production process in creating this gallery system.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/9/Gallery.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/9/responsive/Gallery-xs.PNG 300w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Gallery-sm.PNG 480w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Gallery-md.PNG 768w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Gallery-lg.PNG 1024w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Gallery-xl.PNG 1360w ,https://sebjensen.github.io/c2blog/media/posts/9/responsive/Gallery-2xl.PNG 1600w\"  alt=\"\" width=\"1488\" height=\"774\"></figure>\n<p><span style=\"font-weight: 400;\">I can incorporate this gallery into its own slide that will be targeted at users who need to get a better understanding of Rocket League itself. In turn, this will make for a more accessible experience.</span></p>\n<h2>Perspective project approach</h2>\n<p><span style=\"font-weight: 400;\">This session’s <strong>successes</strong> include the creation of various interactive features to include in my interactive kiosk product, as well as the use of some animations in a gallery and on a splash screen. These will be good for engaging the user, keeping them interested, and have them invest themselves in the information and experience that my kiosk will provide.</span></p>\n<p><span style=\"font-weight: 400;\">It would have been <strong>even better if</strong> I had created more gallery features to be used across my kiosk. The inclusion of a gallery full of Rocket League in-game screenshots will be highly beneficial to users who do not know much of the game and its premise. The same for images from LAN events, where teams compete in the same arena with each other, would also have gone a long way to further consolidate my introduction to the competitive elements of Rocket League.</span></p>\n<p><span style=\"font-weight: 400;\">This concludes my production milestone for my response to the brief. I intend now to shift my focus towards the post-production process of collating my assets and interactive features and combining them into my final kiosk product. I will begin doing so next session, establishing this as my <strong>short-term focus</strong>.</span></p>\n<p><span style=\"font-weight: 400;\">My <strong>long-term goal</strong> is relevant to the testing and gathering of feedback for my product. To accompany my consistent evaluation of each session’s work and achievements, I will also produce a final evaluation of my interactive kiosk once I have finished the project. These are important as they allow me to reflect on what went well and how I could improve my methods and approach to a similar product in the future.</span></p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-02-02T20:06:30+00:00",
            "date_modified": "2022-02-03T19:18:36+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/using-the-master-slide.html",
            "url": "https://sebjensen.github.io/c2blog/using-the-master-slide.html",
            "title": "Using the master slide",
            "summary": "Especially considering that I have created backgrounds with assets from the Rocket League Esports website, I should now look to using the master slide functionality in PowerPoint. With this, I will be able to apply the backgrounds to the homepage and all the content pages&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Especially considering that I have created backgrounds with assets from the Rocket League Esports website, I should now look to using the master slide functionality in PowerPoint. With this, I will be able to apply the backgrounds to the homepage and all the content pages that I will need to fill with the assets created and copy that I have worked on in previous sessions.</span></p>\n<p><span style=\"font-weight: 400;\">You can use the root slide in the master slide view to add colours and change the font. This will apply to all slide variations. You can also create your own types of slides, which is what I have done to achieve a different background for my homepage and content pages.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/8/Using-master-slide.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/8/responsive/Using-master-slide-xs.PNG 300w ,https://sebjensen.github.io/c2blog/media/posts/8/responsive/Using-master-slide-sm.PNG 480w ,https://sebjensen.github.io/c2blog/media/posts/8/responsive/Using-master-slide-md.PNG 768w ,https://sebjensen.github.io/c2blog/media/posts/8/responsive/Using-master-slide-lg.PNG 1024w ,https://sebjensen.github.io/c2blog/media/posts/8/responsive/Using-master-slide-xl.PNG 1360w ,https://sebjensen.github.io/c2blog/media/posts/8/responsive/Using-master-slide-2xl.PNG 1600w\"  alt=\"\" width=\"1855\" height=\"850\"></figure>\n<h2>Perspective project approach</h2>\n<p><span style=\"font-weight: 400;\">The primary <strong>strength</strong> from this session is that now I will be able to ensure consistency and continuity across all slides that I will create for my interactive kiosk product. This will go a long way to keep a positive and sensical user experience, where all slides will feel familiar and associated with each other and the Rocket League Esports website that I am reimagining.</span></p>\n<p><span style=\"font-weight: 400;\">It would be <strong>even better if</strong> I added extra features to my template for the content slides. While I have been able to add a background and fonts that will be shared across these slides, it would save more time when putting the assets together if I sorted out the layout by adding shapes and extra text boxes now. While I can still duplicate slides, this will not be as efficient.</span></p>\n<p>My <strong>short-term goal</strong> that I wish to complete in the next session(s) is to look at how I will be able to incorporate animations into my interactive kiosk product. I also want to refer back to my initial research for the various interactive features I identified. I can then port some or all of these across into a kiosk format.</p>\n<p>In the <strong>long-term</strong>, I will need to consider how I want to set out the homepage and all of the content page. Now I have sorted out the master slide, it will save me from having to sort out the background each time I create a new content slide. I need to think about how I want to combine text with the assets I have collected and created.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-02-02T20:05:56+00:00",
            "date_modified": "2022-02-03T19:22:29+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/creating-assets.html",
            "url": "https://sebjensen.github.io/c2blog/creating-assets.html",
            "title": "Creating assets",
            "summary": "I have collected a number of assets from the Rocket League Esports website that I am looking to rework and adapt for a different audience in a kiosk format. However, there are a number of additional assets that I will need to create to accompany&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">I have collected a number of assets from the Rocket League Esports website that I am looking to rework and adapt for a different audience in a kiosk format. However, there are a number of additional assets that I will need to create to accompany what I have collected. I can use what I have taken from the source and adapt them by harnessing various media production techniques. This will involve the use of Photoshop mostly, though PowerPoint also offers limited options for adding borders, recolouring images and such, too.</span></p>\n<p><span style=\"font-weight: 400;\">When creating and adapting these assets, I will follow my already established means of organising the files. Except, all of my new files will fall under a “Adapted / Original” folder at the top level, alongside the “Source” folder that I was using last session. I will ensure that I am using appropriate file formats, such as using .PNG where transparency is necessary and using .JPG for smaller files where it is not. I will also keep up with giving my new assets sensical names and placing them in a similar file structure. This will make my assets folder easily navigable and searching across all folders for particular assets will be easy, too.</span></p>\n<p><span style=\"font-weight: 400;\">By using Google Drive for Desktop, I am able to access all of my files regardless of which device I use each session. My adapted and original assets will also be synced with the cloud for ease of use and access.</span></p>\n<h3>Start</h3>\n<p><span style=\"font-weight: 400;\">I want to include a splash screen that will display at the start of the kiosk experience when it isn’t being used. I detailed this in my post about structure and layout. I have used the font identified when conducting my focused research and the colours, too.</span></p>\n<p><span style=\"font-weight: 400;\">To create the button, I used the shape tool in Photoshop to create a parallelogram and apply a gradient colour over the top. I then used the text tool to add the “Start” text, intentionally using bold weighting to emphasise it.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/Start-Button.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/Start-Button-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Start-Button-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Start-Button-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Start-Button-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Start-Button-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Start-Button-2xl.png 1600w\"  alt=\"\" width=\"369\" height=\"87\"></figure>\n<h3>Homepage</h3>\n<p><span style=\"font-weight: 400;\">I wanted the featured buttons on the homepage to be eye-catching, and started first and foremost by creating a yellow-gold stroke. This draws the user’s attention to the content, and I have used the same font used by RLCS for the caption to ensure continuity and consistency. I have made use of two of the assets I collected last session.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/HP-Meet-the-Teams.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Meet-the-Teams-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Meet-the-Teams-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Meet-the-Teams-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Meet-the-Teams-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Meet-the-Teams-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Meet-the-Teams-2xl.png 1600w\"  alt=\"\" width=\"348\" height=\"257\"></figure><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://sebjensen.github.io/c2blog/media/posts/7/HP-Where-to-Watch.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Where-to-Watch-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Where-to-Watch-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Where-to-Watch-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Where-to-Watch-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Where-to-Watch-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/HP-Where-to-Watch-2xl.png 1600w\"  alt=\"\" width=\"349\" height=\"258\"></figure>\n<h3>Menu &amp; Navigation</h3>\n<p><span style=\"font-weight: 400;\">I wanted to create a selection of bold and prominent button designs to be used in a single menu and navigation slide. The size of each button establishes hierarchy, and some also use the assets I collected last session to further engage the user. To accomplish this, I had to use gradients for where I wanted the colour to fade out, and layers to display the text above the background colour. There was also the application of a faint drop shadow with the text to create distance and a sense of depth between layers.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-About.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-About-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-About-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-About-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-About-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-About-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-About-2xl.png 1600w\"  alt=\"\" width=\"249\" height=\"619\"></figure><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-Upcoming.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Upcoming-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Upcoming-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Upcoming-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Upcoming-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Upcoming-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Upcoming-2xl.png 1600w\"  alt=\"\" width=\"246\" height=\"619\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-Fan-Rewards.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Fan-Rewards-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Fan-Rewards-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Fan-Rewards-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Fan-Rewards-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Fan-Rewards-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Fan-Rewards-2xl.png 1600w\"  alt=\"\" width=\"360\" height=\"128\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-Gallery.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Gallery-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Gallery-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Gallery-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Gallery-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Gallery-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Gallery-2xl.png 1600w\"  alt=\"\" width=\"360\" height=\"130\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-News.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-News-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-News-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-News-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-News-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-News-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-News-2xl.png 1600w\"  alt=\"\" width=\"360\" height=\"127\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-Meet-the-Teams.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Meet-the-Teams-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Meet-the-Teams-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Meet-the-Teams-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Meet-the-Teams-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Meet-the-Teams-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Meet-the-Teams-2xl.png 1600w\"  alt=\"\" width=\"325\" height=\"286\"></figure><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://sebjensen.github.io/c2blog/media/posts/7/NAV-Where-to-Watch.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Where-to-Watch-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Where-to-Watch-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Where-to-Watch-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Where-to-Watch-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Where-to-Watch-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/NAV-Where-to-Watch-2xl.png 1600w\"  alt=\"\" width=\"331\" height=\"284\"></figure>\n<h3>Background</h3>\n<p><span style=\"font-weight: 400;\">All backgrounds will follow a consistent design. There should be a half-opaque bar in the top half of the background where the title will be placed. This will increase legibility, as I wish to use the same orange-gold colour for my text. I used the assets from the source I collected and used layers to reduce the opacity of a black rectangle I created with the shape tool.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/Content.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/Content-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Content-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Content-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Content-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Content-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Content-2xl.png 1600w\"  alt=\"\" width=\"2004\" height=\"1126\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/Homepage.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/Homepage-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Homepage-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Homepage-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Homepage-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Homepage-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Homepage-2xl.png 1600w\"  alt=\"\" width=\"2062\" height=\"1127\"></figure>\n<h3>Fan Rewards</h3>\n<p><span style=\"font-weight: 400;\">I used text, gradients to increase legibility, assets that I collected from the source, and layers to organise all of these. The differing sizes in text establishes hierarchy. I wanted to display some of the fan rewards that the user could obtain for watching the tournaments live. These will all be displayed on a fan rewards slide.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/Fan-Rewards-Items.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/Fan-Rewards-Items-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Fan-Rewards-Items-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Fan-Rewards-Items-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Fan-Rewards-Items-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Fan-Rewards-Items-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/Fan-Rewards-Items-2xl.png 1600w\"  alt=\"\" width=\"1405\" height=\"587\"></figure>\n<h3>Logos &amp; Extras</h3>\n<p><span style=\"font-weight: 400;\">I added a drop shadow to the logo to create a sense of depth.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/RLCS-Wordmark-Gold.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/RLCS-Wordmark-Gold-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/RLCS-Wordmark-Gold-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/RLCS-Wordmark-Gold-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/RLCS-Wordmark-Gold-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/RLCS-Wordmark-Gold-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/RLCS-Wordmark-Gold-2xl.png 1600w\"  alt=\"\" width=\"1067\" height=\"235\"></figure>\n<p><span style=\"font-weight: 400;\">I also took social media platform logos from the Internet and applied them to an orange-gold shape that I created beforehand with the shape tool.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/7/SM-Instagram.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Instagram-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Instagram-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Instagram-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Instagram-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Instagram-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Instagram-2xl.png 1600w\"  alt=\"\" width=\"55\" height=\"57\"></figure><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: 18.4px; font-weight: var(--font-weight-normal); outline: 3px solid rgba(var(--primary-color-rgb), 0.55)  !important;\" src=\"https://sebjensen.github.io/c2blog/media/posts/7/SM-Twitch.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitch-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitch-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitch-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitch-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitch-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitch-2xl.png 1600w\"  alt=\"\" width=\"55\" height=\"57\"></figure><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://sebjensen.github.io/c2blog/media/posts/7/SM-Twitter.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitter-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitter-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitter-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitter-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitter-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-Twitter-2xl.png 1600w\"  alt=\"\" width=\"54\" height=\"57\"></figure><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://sebjensen.github.io/c2blog/media/posts/7/SM-YouTube.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-YouTube-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-YouTube-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-YouTube-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-YouTube-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-YouTube-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/7/responsive/SM-YouTube-2xl.png 1600w\"  alt=\"\" width=\"54\" height=\"57\"></figure>\n<h2>Perspective project approach</h2>\n<p><span style=\"font-weight: 400;\">The main <strong>strength </strong>for this session was my creation of a multitude of new assets, and how I’ve been able to draw from source assets I had collected and features I had identified in my focused research. I will be able to combine all these assets into a final product for my response to the brief.</span></p>\n<p><span style=\"font-weight: 400;\">It would be <strong>even better if</strong> I had created a few more assets from scratch as opposed to drawing from the assets I had already collected as often as I did. This would consolidate my efforts to adapt the existing website for a different audience in a kiosk format. While I have still managed to do so, making more assets entirely independently would further benefit me in reimagining an existing product.</span></p>\n<p><span style=\"font-weight: 400;\">My <strong>short-term</strong> goal is to look at how I can use the master slide. I already have thoughts about how I could use its functionality to ensure a consistent house style throughout my product. This includes colours, fonts, and how I can use the same background with every slide.</span></p>\n<p><span style=\"font-weight: 400;\">My <strong>long-term</strong> goal still looks to how I can combine my newly created and adapted assets with the source assets that I collected last session. To accomplish this, I will also need to consider animations and the various interactive features that I wish to incorporate into my product.</span></p>\n<p> </p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-02-02T20:05:39+00:00",
            "date_modified": "2022-02-03T19:13:52+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/collecting-images-videos-audio.html",
            "url": "https://sebjensen.github.io/c2blog/collecting-images-videos-audio.html",
            "title": "Collecting images, videos, audio",
            "summary": "The proper organisation of collected assets in a sensical folder structure is quintessential to an efficient workflow. In today's session, I have collected all the images, videos, and audio that I will need for me to rework the Rocket League Esports website in response to&hellip;",
            "content_html": "<p>The proper organisation of collected assets in a sensical folder structure is quintessential to an efficient workflow. In today's session, I have collected all the images, videos, and audio that I will need for me to rework the Rocket League Esports website in response to the brief. In my production documents folder, I have created a 'Source' sub-folder, which then branches into an intuitive setup with all the assets I have collected. At the top layer, I will also be able to make another folder for any adapted and newly created assets.</p>\n<p>It is also important to ensure that all files and collected assets are named effectively and appropriately. I have ensured that all file names offer the necessary detail needed to understand its purpose and contents with or without a file preview. For example, \"FR Instigator Title.png\" makes it clear that the image is related to fan rewards (\"FR\"), and is the Instigator Title cosmetic in-game.</p>\n<p>I have also considered file extensions and formats, balancing the need for alpha data in some assets (such as to allow transparency in a logo) and file size optimisation (where a .JPG might be used).</p>\n<p>I am utilising Google Drive for Desktop to keep my files and data in sync with the cloud. This means that I will always have access to my files online, regardless of which device I am using.</p>\n<h2>Collected assets &amp; structure</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-1-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-1-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-1-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-1-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-1-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-1-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"595\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-2.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-2-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-2-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-2-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-2-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-2-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-2-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"595\"></figure>\n<h3>Audio</h3>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-a1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-a1-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-a1-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-a1-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-a1-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-a1-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-a1-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"595\"></figure>\n<h3>Images</h3>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-b1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b1-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b1-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b1-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b1-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b1-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b1-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"595\"></figure>\n<h4>Fan Rewards</h4>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-b2.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b2-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b2-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b2-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b2-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b2-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b2-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"635\"></figure>\n<h4>In-Game Screenshots</h4>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-b3.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b3-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b3-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b3-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b3-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b3-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b3-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"635\"></figure>\n<h4>Team Logos</h4>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-b4.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b4-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b4-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b4-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b4-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b4-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-b4-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"635\"></figure>\n<h3>Videos</h3>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/6//org-c1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-c1-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-c1-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-c1-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-c1-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-c1-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/6//responsive/org-c1-2xl.jpg 1600w\"  alt=\"\" width=\"953\" height=\"635\"></figure>\n<h2>Perspective project approach</h2>\n<p>This session's <strong>strengths </strong>included my thorough consideration of file management and navigation when collecting and storing assets from the source (Rocket League Esports website). The setup is intuitive, and it is also stored in and synced with the cloud, so I can access it from any device in school.</p>\n<p>It would have been <strong>even better if </strong>I was able to find individual .mp3 files for the in-game goal event chimes. While I still have all the audio, it is just in a single file, and I will need to cut through this and trim it down to the specific sound effect I want in the future. Having each chime sound effect separate would be more sensical.</p>\n<p>Now that I have collected images, video, and audio, I can begin to look at creating my own assets in the next session as a <strong>short-term goal</strong>. I will also be able to adapt what I have collected and will also document this.</p>\n<p>In the <strong>long-term</strong>, I will have to think about how I can incorporate the various interactive elements and features that I outlined in my initial research document. This included the use of buttons, galleries, and the inclusion of a video. I will be able to use the assets I have collected today for this.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-02-01T21:04:16+00:00",
            "date_modified": "2022-02-01T21:11:41+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/writing-editing-text-hyperlinks.html",
            "url": "https://sebjensen.github.io/c2blog/writing-editing-text-hyperlinks.html",
            "title": "Writing, editing text / Hyperlinks",
            "summary": "I am beginning the production phase of my reimagination of an existing product, specifically my reworking of the Rocket League Esports webpage. I have decided to do so with writing copy and editing the text on the source/original site. In doing so, I have also&hellip;",
            "content_html": "<p>I am beginning the production phase of my reimagination of an existing product, specifically my reworking of the Rocket League Esports webpage. I have decided to do so with writing copy and editing the text on the source/original site. In doing so, I have also made use of hyperlinks to incorporate external, official source pages.</p>\n<p>Text is essential to conveying meaning and purpose and the inclusion of hyperlinks serves to be beneficial. This will allow me to embed and draw in external information from sources not affected by the kiosk slideshow's offline-only operation.</p>\n<h2>Writing, editing text</h2>\n<p>I have collected copy from the source (the Rocket League Esports webpage) and adapted it for my response to the brief. In doing so, I have edited the font - changing the colour, adding bold elements and considered weighting, as well as add italic elements, too. This also includes hyperlinking words/phrases.</p>\n<p>Consequently, the text featured in my final kiosk product will be more engaging and fit the design and layout more seamlessly. By cutting out unnecessary details, or alternatively adding more text where it is necessary, I have considered the user experience. This is designed to be a kiosk to be shown in an exhibition or showcase, and all users should be treated as new.</p>\n<table style=\"height: 781px;\">\n<tbody>\n<tr style=\"height: 75px;\">\n<td style=\"height: 75px; width: 716px;\" colspan=\"2\">\n<p><strong>Source </strong><span style=\"font-weight: 400;\">| esports.rocketleague.com</span></p>\n</td>\n</tr>\n<tr style=\"height: 278px;\">\n<td style=\"height: 278px; width: 129px;\">\n<p><strong>About</strong><strong><br></strong><span style=\"font-weight: 400;\">(Home)</span></p>\n</td>\n<td style=\"height: 278px; width: 587px;\">\n<p><span style=\"font-weight: 400;\">THE ROCKET LEAGUE CHAMPIONSHIP SERIES (RLCS) 2021-22 SEASON IS HERE AND BIGGER THAN EVER. THE WORLD'S PREMIER PROFESSIONAL ROCKET LEAGUE COMPETITION IS BACK WITH $6,000,000 IN PRIZING UP FOR GRABS, AN OPEN CIRCUIT-BASED FORMAT, MORE REGIONS, AND LANS MAKING THEIR RETURN, THE LEAGUE IS SET TO MAKE ANOTHER LEAP FORWARD. SIGN UP SOON TO COMPETE AGAINST THE BEST TEAMS IN THE WORLD. DO YOU HAVE WHAT IT TAKES?</span></p>\n</td>\n</tr>\n<tr style=\"height: 162px;\">\n<td style=\"height: 162px; width: 129px;\">\n<p><strong>About</strong><strong><br></strong><span style=\"font-weight: 400;\">(Announce)</span></p>\n</td>\n<td style=\"height: 162px; width: 587px;\">\n<p><span style=\"font-weight: 400;\">The Rocket League Championship Series (RLCS) is back and bigger than ever! With the largest RLCS prize pool ever of $6,000,000, more regions, and an updated format, the RLCS 2021-22 season is set to be the most exciting one yet.</span></p>\n</td>\n</tr>\n<tr style=\"height: 162px;\">\n<td style=\"height: 162px; width: 129px;\">\n<p><strong>Fan Rewards</strong></p>\n</td>\n<td style=\"height: 162px; width: 587px;\">\n<p><span style=\"font-weight: 400;\">WANT TO START EARNING FAN REWARDS ON OFFICIAL ROCKET LEAGUE ESPORTS TWITCH BROADCASTS? SIMPLY LINK YOUR TWITCH ACCOUNT TO YOUR PLATFORM OF CHOICE AND START EARNING TODAY!</span></p>\n</td>\n</tr>\n<tr style=\"height: 104px;\">\n<td style=\"height: 104px; width: 129px;\">\n<p><strong>Tagline</strong></p>\n</td>\n<td style=\"height: 104px; width: 587px;\">\n<p><span style=\"font-weight: 400;\">THE WORLD'S PREMIER PROFESSIONAL ROCKET LEAGUE COMPETITION IS BACK.</span></p>\n</td>\n</tr>\n</tbody>\n</table>\n<table>\n<tbody>\n<tr>\n<td colspan=\"2\">\n<p><strong>Adapted &amp; New</strong></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>About RLCS</strong></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Introducing </span><strong>RLCS</strong><span style=\"font-weight: 400;\"> (the Rocket League Championship Series) - the 2021-22 season </span><strong>is here and bigger than ever</strong><span style=\"font-weight: 400;\">!</span><span style=\"font-weight: 400;\"> There’s </span><i><span style=\"font-weight: 400;\">$6,000,000</span></i><span style=\"font-weight: 400;\"> in prizing up for grabs in the world’s premier professional Rocket League competition. There’s the open-circuit format, now more regions, and LAN events will be making their return, too. Sign up soon to compete against the best teams in the world. </span><i><span style=\"font-weight: 400;\">Do you have what it takes?</span></i></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Tagline</strong></p>\n</td>\n<td>\n<p><strong>THE WORLD’S PREMIER ROCKET LEAGUE COMPETITION</strong></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Where to Watch</strong></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Watch the games live from our various </span><strong>Twitch channels</strong><span style=\"font-weight: 400;\">, and catch up with our </span><strong>Clips of the Week</strong><span style=\"font-weight: 400;\"> series on </span><a href=\"https://www.youtube.com/channel/UCdKuPY64fEpI4cdlBSyvEJw\"><span style=\"font-weight: 400;\">YouTube</span></a><span style=\"font-weight: 400;\"> (from the EU and NA region). </span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Fan Rewards</strong></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Win a selection of in-game cosmetics by tuning into tournaments on </span><a href=\"https://www.twitch.tv/rocketleague\"><strong>Twitch</strong></a><span style=\"font-weight: 400;\">.</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Teams</strong></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">The </span><strong>Rocket League Championship Series (RLCS)</strong><span style=\"font-weight: 400;\"> is home to some of Esport’s most prestigious and successful teams and players.</span></p>\n<br>\n<p><span style=\"font-weight: 400;\">Think you’ve got what it takes? You too can form your own team and play in our official games on the </span><a href=\"https://battlefy.com/leagues/rlcs/seasons/2020/details\"><span style=\"font-weight: 400;\">RLCS tournament website</span></a><span style=\"font-weight: 400;\">.</span></p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>PDF document (incl. coloured text): <a href=\"https://drive.google.com/file/d/1zpUMhZuAxtcIqYUxWu-QIgJcISCgtBy0/view?usp=sharing\" target=\"_blank\" rel=\"noopener noreferrer\">https://drive.google.com/file/d/1zpUMhZuAxtcIqYUxWu-QIgJcISCgtBy0/view?usp=sharing</a></p>\n<h2>Hyperlinks</h2>\n<p>I have used hyperlinks to bring in extra information and links to official, external resources from the original Rocket League Esports website. These links will be able to be opened in a browser from within the kiosk, and as such, can be used to provide access to other resources and information that can be kept up-to-date beyond the kiosk.</p>\n<p>I can use the 'Action Settings' interface within PowerPoint to easily link up to external resources when an object is clicked. In this case, I have been able to highlight the text and apply the hyperlink to the Rocket League Twitch channel.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/5/hyperlink.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/5/responsive/hyperlink-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/5/responsive/hyperlink-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/5/responsive/hyperlink-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/5/responsive/hyperlink-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/5/responsive/hyperlink-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/5/responsive/hyperlink-2xl.jpg 1600w\"  alt=\"\" width=\"780\" height=\"564\"></figure>\n<h2>Perspective project approach</h2>\n<p><strong>Strengths </strong>included my use of hyperlinks to include access to external, official resources that will not be affected by the kiosk slideshow's offline operation. By linking to the Twitch channel, for example, users will be able to view the livestream.</p>\n<p>It would be <strong>even better if </strong>I hyperlinked more of the text I have wrote and edited for my interactive kiosk. The same overarching reason for this persists - the kiosk will not be able to download and present data from the internet. Hyperlinks offer a means of showing accurate information from official sources.</p>\n<p>My <strong>short-term goal</strong>, specifically for the next session, is to collect the sound, videos, and images that I will need for when I bring all of the elements together for my kiosk product. I intend to organise these in a sensical file structure, where all the files I will need for my product can easily be located with clear names.</p>\n<p>My <strong>long-term focus </strong>remains on how I intend to bring all the elements together. This also includes what assets I want to and/or will need to create myself using production techniques I have previously experimented with. Eventually, I will also need to consider hierarchy can be harnessed to guide the user experience.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-01-25T21:04:07+00:00",
            "date_modified": "2022-02-01T20:19:05+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/wireframe-visualisation-diagram.html",
            "url": "https://sebjensen.github.io/c2blog/wireframe-visualisation-diagram.html",
            "title": "Wireframe / Visualisation diagram",
            "summary": "I have conducted wider and focused initial research and identified key features, means of interactivity, sorts of assets I would need. I have also set out and determined the structure and layout of my reimagination of the Rocket League Esports website, in response to the&hellip;",
            "content_html": "<p>I have conducted wider and focused initial research and identified key features, means of interactivity, sorts of assets I would need. I have also set out and determined the structure and layout of my reimagination of the Rocket League Esports website, in response to the brief while adapting it for a different audience.</p>\n<p>I can now consolidate the creative direction I wish to follow and build upon my initial mind map and mood boards. Wireframes and visualisation diagrams are an adequate means of presenting how I wish my product to be designed and set out. In creating the following documents, I am satisfied that I have concluded the pre-production process.</p>\n<h2>Wireframe</h2>\n<p>Wireframes aid the pre-production process considerably, in that they allow you to create a quick sketch of where various elements will be placed and interact with one another. They are not time consuming to create as they are very basic diagrams, making them an efficient and effective pre-production document to produce and have on-hand during work towards the production and post-production milestones.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/4/wireframe-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/4/responsive/wireframe-2-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/wireframe-2-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/wireframe-2-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/wireframe-2-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/wireframe-2-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/wireframe-2-2xl.png 1600w\"  alt=\"\" width=\"783\" height=\"533\"></figure>\n<p>In the above I have laid out two high-traffic slides that will be implemented as part of my kiosk and reimagination of the Rocket League Esports website. I used boxes with crosses to denote images, and lines to denote text/copy. I have also included buttons and other icons and annotations to the side of the wireframe to elaborate on features.</p>\n<p>It was particularly quick to produce these two wireframes, thus proving their efficacy in terms of an efficient pre-production workflow and cycle. I was able to include the key details surrounding layout and features with ease.</p>\n<h2>Visualisation diagram</h2>\n<p>Visualisation diagrams as a pre-production document could be considered an evolution upon a wireframe. It still demonstrates the desired layout and design, and includes more detail, of the specific design elements I'm wanting to use. They are a lot closer to how the final product will look, but are still relatively quick to produce.</p>\n<p>I have taken the two wireframes I already produced and have progressed them into a visualisation diagram.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/4/Annotated-Visualisation-Diagram.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/4/responsive/Annotated-Visualisation-Diagram-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Annotated-Visualisation-Diagram-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Annotated-Visualisation-Diagram-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Annotated-Visualisation-Diagram-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Annotated-Visualisation-Diagram-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Annotated-Visualisation-Diagram-2xl.png 1600w\"  alt=\"\" width=\"8021\" height=\"3144\"></figure>\n<h4>No annotations</h4>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/4/Visualisation-Diagram-1.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-1-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-1-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-1-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-1-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-1-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-1-2xl.png 1600w\"  alt=\"\" width=\"3556\" height=\"2000\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/4/Visualisation-Diagram-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-2-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-2-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-2-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-2-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-2-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/4/responsive/Visualisation-Diagram-2-2xl.png 1600w\"  alt=\"\" width=\"3556\" height=\"2000\"></figure>\n<h2>Perspective project approach</h2>\n<p>I have clearly demonstrated my <strong>strengths </strong>in the creation of my last two pre-production documents, two wireframes and visualisation diagrams. I have consolidated my creative direction that I set out initially with my mind map and mood boards and developed with my focused research and consideration of structure and layout.</p>\n<p>It would have been <strong>even better if </strong>I created more wireframes and visualisation diagrams to aid my efforts towards the production and post-production milestones. That said, though, it is important to consider the significance of time management when responding to a brief, and I believe I achieved a substantial amount with the sessions I dedicated to pre-production.</p>\n<p>My <strong>goals </strong>now shift to the production and post-production milestones. In the short-term I will have to consider how I intend to progress through the production cycle. I intend to begin with writing and incorporating text and copy into the kiosk, and use hyperlinks to connect slides and external links. As I work through this, I will also need to continually think ahead into the long-term and consider how I intend to piece together all of these different elements.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Pre-Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-01-25T20:42:02+00:00",
            "date_modified": "2022-01-26T16:55:33+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/identifying-assets-structure-and-layout.html",
            "url": "https://sebjensen.github.io/c2blog/identifying-assets-structure-and-layout.html",
            "title": "Identifying assets / Structure and layout",
            "summary": "To build upon and consolidate the pre-production efforts from my last two sessions, I am taking the time to identify the key assets or sorts of assets that I would need to use when reimagining the Rocket League Esports homepage in response to the brief.",
            "content_html": "<p>To build upon and consolidate the pre-production efforts from my last two sessions, I am taking the time to identify the key assets or sorts of assets that I would need to use when reimagining the Rocket League Esports homepage in response to the brief. This will satisfy the short-term goal I set out in my aim to take a perspective approach to the progression of my project. Following this, I will also consider the structure and layout and user experience of the product I am adapting for a kiosk format and wider audience.</p>\n<h2>Identifying key assets</h2>\n<p>I have built upon the brief reference to the assets I would need by dedicating part of the pre-production process to identifying media and sorts of media that are relevant to the reworked product I am producing.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia1.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia1-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia1-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia1-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia1-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia1-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia1-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia2-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia2-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia2-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia2-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia2-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia2-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia3.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia3-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia3-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia3-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia3-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia3-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia3-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia4.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia4-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia4-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia4-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia4-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia4-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia4-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia5.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia5-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia5-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia5-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia5-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia5-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia5-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia6.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia6-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia6-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia6-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia6-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia6-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia6-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/ia7.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia7-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia7-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia7-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia7-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia7-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/ia7-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<h2>Structure and layout</h2>\n<p>Ensuring I focus on the structure and layout of my interactive esports product will benefit me greatly when I begin utilising media production skills and techniques to rework the Rocket League Esports homepage. It can serve as a checklist of sorts, a specification that I can follow to ensure that I am including all of the functionality, information, and interactive features to create and develop a good, seamless, and intuitive user experience.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/3/Structure-Diagram.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/3/responsive/Structure-Diagram-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/Structure-Diagram-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/Structure-Diagram-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/Structure-Diagram-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/Structure-Diagram-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/3/responsive/Structure-Diagram-2xl.png 1600w\"  alt=\"\" width=\"4352\" height=\"3365\"></figure>\n<h2>Perspective project approach</h2>\n<p><strong>Strengths</strong> include my direct response to my primary documented weakness from last session, the absence of substantial identified key assets. I have amended this by dedicating effort to the collation of various media that would be significant in my response to the brief.</p>\n<p><strong>Weaknesses </strong>include the limited sample of key assets I have identified. However, I believe I have a satisfactory selection of assets that would be significant in my response to the brief. It is important to note that the management of both time and effort is paramount in maintaining an effective and efficient workflow.</p>\n<p>My <strong>short-term goal </strong>now concerns the production of wireframes and visualisation diagrams, and I intend to achieve this goal in the next session. This will conclude my pre-production process upon completion.</p>\n<p>In terms of <strong>long-term goals</strong>, my focus will now begin to shift to the production process, with consideration for the post-production process that will follow it. I need to round up my pre-production work and efforts before beginning to collect and organise the assets I intend to use as well as creating new assets that I need.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Pre-Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-01-24T20:39:44+00:00",
            "date_modified": "2022-01-26T16:31:58+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/focused-research-identifying-key-features.html",
            "url": "https://sebjensen.github.io/c2blog/focused-research-identifying-key-features.html",
            "title": "Focused research / Identifying key features",
            "summary": "I believe the scope of the Rocket League Esports website could be easily reimagined in the format of a kiosk as to adapt it for a different audience. Consequently, it is necessary that I conduct further, focused research on said interactive esports product so that&hellip;",
            "content_html": "<p>I believe the scope of the Rocket League Esports website could be easily reimagined in the format of a kiosk as to adapt it for a different audience. Consequently, it is necessary that I conduct further, focused research on said interactive esports product so that I can adequately rework its features and elaborate upon it professionally. In doing so, I would also identify the key features of the website, and I will then be able to reference back to this developed research and product specification during the production and post-production process.</p>\n<p>I detailed a brief outline of what I would like to achieve (setting targets for myself). I also identified the key colour scheme, some media assets I would need to utilise, and listed the key features of the Rocket League Esports homepage. The product of this session's efforts are embedded below:</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/2/fr1.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr1-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr1-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr1-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr1-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr1-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr1-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/2/fr2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr2-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr2-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr2-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr2-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr2-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr2-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/2/fr3.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr3-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr3-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr3-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr3-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr3-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr3-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/2/fr4.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr4-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr4-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr4-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr4-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr4-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr4-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/2/fr5.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr5-xs.png 300w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr5-sm.png 480w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr5-md.png 768w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr5-lg.png 1024w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr5-xl.png 1360w ,https://sebjensen.github.io/c2blog/media/posts/2/responsive/fr5-2xl.png 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<h2>Perspective project approach</h2>\n<p><strong>Strengths </strong>include my identification of key interactive features, such as the fan rewards gallery, that I would be able to translate into a kiosk format by using the trigger animation functionality included in PowerPoint. This will ensure a more effective and efficient design workflow as I will already have detailed the content I intend to include.</p>\n<p><strong>Weaknesses </strong>include the limited detailing of media that I would need to include when I reimagine the Rocket League Esports homepage. While I have mentioned the logo and two videos to include, there is little mention of what images I could include and modify to create my own assets.</p>\n<p>My <strong>short-term goal </strong>is to identify the specific assets or sorts of assets that I would need to collect and collate to be used in my response to the brief. This rectifies the primary weakness of this session that I just detailed.</p>\n<p>My <strong>long-term goal </strong>is to establish the structure and layout of the kiosk, supporting this with wireframe documents and, subsequently, the creation of various visualisation diagrams to support my production and post-production milestones.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Pre-Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-01-24T20:18:53+00:00",
            "date_modified": "2022-01-24T20:18:53+00:00"
        },
        {
            "id": "https://sebjensen.github.io/c2blog/mind-map-mood-board-wider-research.html",
            "url": "https://sebjensen.github.io/c2blog/mind-map-mood-board-wider-research.html",
            "title": "Mind map / Mood board / Wider research",
            "summary": "I am having to respond to a brief pertaining to the creation of an interactive esports product, and am doing so by reimagining an existing product. Specifically, I wish to recreate an esports website for a popular competitive gaming league, adapting it for a different&hellip;",
            "content_html": "<p>I am having to respond to a brief pertaining to the creation of an interactive esports product, and am doing so by reimagining an existing product. Specifically, I wish to recreate an esports website for a popular competitive gaming league, adapting it for a different audience by reworking it into a new kiosk format.</p>\n<p>To develop my product I will begin initially with various pre-production processes and procedures to conduct ideation. This includes the creation of a mind map, various mood boards, and researching pre-existing products that I may wish to reimagine. These will orient myself adequately for the production and post-production milestones that will follow. I will then need to be evaluative and critical of my work.</p>\n<p>In my response to the brief, I will be documenting my progress with this blog that you are reading. Setting short term and long term goals and targets will be critical to the successful creation of my product.</p>\n<h2>Mind map</h2>\n<p>Visualising a plethora of thoughts and concepts is easily done with the use of a mind map. By using labels, nodes, and sub-nodes, a multitude of ideas can be collated on a single page and I have harnessed the flexibility of mind maps to present my initial ideas on how I intend to respond to the brief. I am already set on reworking a pre-existing product to produce an interactive kiosk.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/1/mindmap.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/1/responsive/mindmap-xs.PNG 300w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/mindmap-sm.PNG 480w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/mindmap-md.PNG 768w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/mindmap-lg.PNG 1024w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/mindmap-xl.PNG 1360w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/mindmap-2xl.PNG 1600w\"  alt=\"\" width=\"1091\" height=\"829\"></figure>\n<h2>Mood boards</h2>\n<p>I compiled a large variety of esports material from numerous sources on the Internet to produce three initial mood boards. These cover the common themes of games with competitive and official esports series, examples of various esports organisation logos, and a plethora of pre-existing esports website.</p>\n<p>In producing these mood boards, I am able to establish a visual and creative direction for the project. I intend to adapt an esports website into a kiosk which would be featured at an esports event and/or exhibition for the series. While I'm still undecided on the game, I'm leaning towards Rocket League, having investigated the various options for competitive gameplay and being a regular player of the game.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/1/c2b-01.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-01-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-01-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-01-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-01-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-01-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-01-2xl.jpg 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/1/c2b-02.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-02-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-02-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-02-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-02-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-02-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-02-2xl.jpg 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://sebjensen.github.io/c2blog/media/posts/1/c2b-03.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-03-xs.jpg 300w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-03-sm.jpg 480w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-03-md.jpg 768w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-03-lg.jpg 1024w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-03-xl.jpg 1360w ,https://sebjensen.github.io/c2blog/media/posts/1/responsive/c2b-03-2xl.jpg 1600w\"  alt=\"\" width=\"1920\" height=\"1080\"></figure>\n<h2>Wider research</h2>\n<p>It is important to conduct presentable wider research into other products that may hold some relevance to me when I am creating a product in response to the brief. Having already investigated the variety of games with options for competitive gameplay on offer, I have decided to target my research towards three pre-existing interactive products.</p>\n<p>I have examined the Rocket League Esports, F1 Esports, and Valorant Esports websites, looking for common themes and shared codes and conventions. I can see what specific terminology they employ and that I will need to replicate, as well as key features and consistent inclusions, particularly in terms of interactivity, that would be beneficial to include when I choose to reimagine one of these products.</p>\n<p>Document: <a href=\"https://drive.google.com/file/d/1ZOXY2N_nV_XEz4yMTh6Uay4EriD8Hvsf/view?usp=sharing\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://drive.google.com/file/d/1ZOXY2N_nV_XEz4yMTh6Uay4EriD8Hvsf/view?usp=sharing</a></p>\n<h2>Perspective project approach</h2>\n<p>To conclude (the majority of) my blog entries, I will ensure that I maintain a perspective approach to my response to the brief. In doing so, I will identify strengths and weaknesses, as well as my short term and long term goals and targets.</p>\n<p><strong>Strengths </strong>include my establishment of the common themes and codes of conventions that are shared across pre-existing interactive products relevant to the esports and gaming industry. I have identified key features and means of interactivity that I will be able to consider and bring forward to my response to the brief.</p>\n<p><strong>Weaknesses </strong>include the limited sample size for the wider research that I conducted, compared to the wide variety of media that I included while producing my mood boards. However, I believe that three pre-existing media products will still serve as a valuable reference for when I reimagine a pre-existing interactive product.</p>\n<p>My <strong>short-term goal</strong>, specifically for the next session, is to consolidate my initial research by specifically focusing on the key features of the Rocket League Esports website. I have opted to rework said website, adapting it for a different audience by reformatting it into a kiosk experience.</p>\n<p>As for a <strong>long-term target</strong>, I am looking to conduct thorough research into the Rocket League Esports website, which includes beginning to identify external assets that I might wish to utilise. I intend to reinforce my pre-production work with extra documents, such as wireframes and visualisation diagrams, as well as consider the structure and layout of my reimagined product.</p>",
            "author": {
                "name": "Seb Jensen"
            },
            "tags": [
                   "Pre-Production",
                   "Esports Kiosk"
            ],
            "date_published": "2022-01-24T19:50:40+00:00",
            "date_modified": "2022-01-27T22:06:40+00:00"
        }
    ]
}
